In [2]:
import numpy as np
import pandas as pd

from pandas import Series,DataFrame

In [3]:
ser1 = Series(data=np.arange(1,4),
             index=['sat1','sat2','sat3'] )

In [4]:
ser1

sat1    1
sat2    2
sat3    3
dtype: int32

In [5]:
ser1.drop('sat1')

sat2    2
sat3    3
dtype: int32

In [6]:
ser1

sat1    1
sat2    2
sat3    3
dtype: int32

In [7]:
ser1.drop('sat1', inplace = True) #kalıcı olmasını sagladık

In [8]:
ser1

sat2    2
sat3    3
dtype: int32

In [9]:
ser1.drop(['sat2','sat3'])

Series([], dtype: int32)

In [10]:
df =  DataFrame(np.arange(9).reshape(3,3),
               index=['sat1','sat2','sat3'],
               columns=['sut1','sut2','sut3'])
df

      sut1  sut2  sut3
sat1     0     1     2
sat2     3     4     5
sat3     6     7     8

In [11]:
df.drop(labels = 'sut1',axis=1)

      sut2  sut3
sat1     1     2
sat2     4     5
sat3     7     8

In [12]:
df.drop(columns='sut1') #2.yöntem

      sut2  sut3
sat1     1     2
sat2     4     5
sat3     7     8

In [13]:
df

      sut1  sut2  sut3
sat1     0     1     2
sat2     3     4     5
sat3     6     7     8

In [14]:
df.drop(labels='sat2',axis=0)

      sut1  sut2  sut3
sat1     0     1     2
sat3     6     7     8

In [15]:
df.drop(index='sat2') #2.yol

      sut1  sut2  sut3
sat1     0     1     2
sat3     6     7     8